//
//  AllPosibilities.swift
//  Nukon
//
//  Created by Kaichi Momose on 2017/11/21.
//  Copyright © 2017 Kaichi Momose. All rights reserved.
//

import Foundation

struct Posibilities {
    let sound: String
    let posibilitiesList: [[String]]
}

struct AllPosibilities {
    let allPosibilitiesList = [Posibilities(sound: "vowel",
                                            posibilitiesList: [["あ", "あー", "ああ"],
                                                               ["1", "い", "いー", "飯", "位", "いい" ,"良い" ,"行く", "いいえ", "行", "11"],
                                                               ["Phi","雨", "右", "風", "生", "歩", "うー", "う", "うん"],
                                                               ["笑", "重", "恵", "回", "へ", "Ai"],
                                                               ["お", "を", "男", "生", "小", "おお", "おー"],
                                                               [" "]]),
                               Posibilities(sound: "K",
                                            posibilitiesList: [["家", "日", "歌", "か"],
                                                               ["き", "鬼", "生", "着", "姫", "駅"],
                                                               ["9","紅", "空", "食", "く", "歩"],
                                                               ["けー", "家", "結", "気"],
                                                               ["こ", "子", "個", "粉", "湖", "小", "古"],
                                                               [" "]]),
                               Posibilities(sound: "S",
                                            posibilitiesList: [["Sara", "左", "さ", "さぁ", "3", "咲", "鎖", "砂"],
                                                               ["4", "7", "私", "次", "子", "氏" ,"紫" ,"志", "猪", "姿"],
                                                               ["す","数", "雛", "すー", "生", "歩"],
                                                               ["西", "青", "せ", "生", "瀬", "聖"],
                                                               ["うそ", "そう", "そ", "早", "草", "奏", "そっ", "ソ", "しそ", "嘘" , "質素"],
                                                               [" "]]),
                               Posibilities(sound: "T",
                                            posibilitiesList: [["た", "波", "太", "立", "起", "田"],
                                                               ["千", "4", "遅", "私", "1", "家" ,"ち" ,"地", "ちー", "乳", "父"],
                                                               ["頭","厨", "豆", "着", "つ", "ツ", "付"],
                                                               ["Perez", "て", "TV", "笑", "で", "体", "弟", "手", "照", "."],
                                                               ["と", "頭", "渡"],
                                                               [" "]]),
                               Posibilities(sound: "N",
                                            posibilitiesList: [["な", "和", "名"],
                                                               ["2", "に", "仁", "飯", "位", "いい"],
                                                               ["2","ニュー", "6", "犬", "エヌ", "歩", "乳", "Nu", "入", "ぬー", "Phi", "流"],
                                                               ["ね", "音", "子", "寝", "値"],
                                                               ["の", "を", "男", "生", "小", "おお", "おー", "のー", "ノー"],
                                                               ["ん", "うん", "んん"]]),
                               Posibilities(sound: "H",
                                            posibilitiesList: [["は", "はは", "はぁ", "波", "母", "はい", "はあ"],
                                                               ["ひ", "日", "氷", "匹", "火", "灯"],
                                                               ["Phi", "父", "布", "風", "付", "歩", "ふ"],
                                                               ["Phi", "へ", "辺", "経", "回", "へ", "Ai"],
                                                               ["歩", "保", "ほ"],
                                                               [" "]]),
                               Posibilities(sound: "M",
                                            posibilitiesList: [["Marle", "間", "今", "まぁ", "まま", "馬", "ま", "磨"],
                                                               ["実", "笑", "ミー", "味", "未", "美" ,"海" ,"明", "み", "御"],
                                                               ["Phi","M", "6", "風", "夢", "犬", "向", "武", "ムー", "む"],
                                                               ["女", "め", "目", "明"],
                                                               ["の", "も", "母", "もう"],
                                                               [" "]]),
                               Posibilities(sound: "Y",
                                            posibilitiesList: [["や", "いや", "8", "家", "熊野", "夜", "谷", "屋", "爺"],
                                                               ["　"],
                                                               ["ユウ","油", "行", "結", "(有)", "祐", "ユ", "湯", "うん"],
                                                               ["　"],
                                                               ["4", "Yo", "夜", "よ", "好"],
                                                               [" "]]),
                               Posibilities(sound: "R",
                                            posibilitiesList: [["Lact", "ら", "ラ", "らー", "裏"],
                                                               ["り", "裏", "理", "びー", "日", "ディー" ,"リー" ,"隣", "李", "里", "リ"],
                                                               ["流","涙", "る", "ルー", "生"],
                                                               ["0", "れ", "で", "俺", "上", "ね", "例", "手", "出", "レ"],
                                                               ["Rola", "6", "ろう", "ろ", "狼", "籠"],
                                                               [" "]]),
                               Posibilities(sound: "W",
                                            posibilitiesList: [["は", "わ", "=", "話", "波", "和", "端", "我"],
                                                               ["　"],
                                                               ["　"],
                                                               ["　"],
                                                               ["お", "を", "男", "生", "小", "おお", "おー", "Wow"],
                                                               [" "]])]
}
