//
//  Posibilities.swift
//  Nukon
//
//  Created by Kaichi Momose on 2018/02/19.
//  Copyright © 2018 Kaichi Momose. All rights reserved.
//

import Foundation

struct PosibilitiesDict {
    let regularPosibilitiesDict = ["あ": ["あ", "あー", "ああ"],
                                   "い": ["い", "いー", "いい", "1", "飯", "いーいー"],
                                   "う": ["う", "うー", "うう", "雨雨","雨", "うん", "生生"],
                                   "え": ["え", "えー", "笑", "へ", "Ai"],
                                   "お": ["お", "おー", "を", "おお"],
                                   "か": ["家", "か", "Cars"],
                                   "き": ["き", "キー"],
                                   "く": ["9", "く", "空空"],
                                   "け": ["けー", "け", "けーけー", "Kate", "家家", "兄兄", "恵恵"],
                                   "こ": ["こ", "子", "神神"],
                                   "さ": ["Sara", "左", "さ", "さぁ", "3", "左左"],
                                   "し": ["7", "シー","私", "しーしー", "氏", "し"],
                                   "す": ["す", "数", "すー"],
                                   "せ": ["せ", "西", "生", "瀬", "聖"],
                                   "そ": ["うそ", "そう", "そ", "奏", "そっ", "ソ"],
                                   "た": ["た", "太", "たー"],
                                   "ち": ["千", "遅", "ち", "ちー", "ちい", "乳乳"],
                                   "つ": ["通", "つ", "ツ"],
                                   "て": ["Perez", "て", "TV", "笑", "."],
                                   "と": ["と", "頭"],
                                   "な": ["な", "なぁ", "名", "なな"],
                                   "に": ["2", "に"],
                                   "ぬ": ["2", "ぬー", "ぬぬ", "ぬーぬー"],
                                   "ね": ["ね", "ねー", "ねぇねぇ"],
                                   "の": ["の", "のー", "ノー"],
                                   "ん": ["ん", "うん", "んん"],
                                   "は": ["は", "はは", "はぁ", "波", "母", "はい", "はあ"],
                                   "ひ": ["ひ", "ひー", "日", "火"],
                                   "ふ": ["父", "布", "風", "付", "歩", "ふ"],
                                   "へ": ["へ", "辺", "へい", "Hey", "へー"],
                                   "ほ": ["歩", "ほ", "法"],
                                   "ま": ["Marle", "間", "今", "まぁ", "まま", "馬", "ま", "磨"],
                                   "み": ["実", "ミー", "み", "御"],
                                   "む": ["M", "6", "ムー", "む"],
                                   "め": ["女", "め", "目", "明"],
                                   "も": ["も", "もう"],
                                   "や": ["や", "いや", "8", "やー"],
                                   "ゆ": ["ユウ","油", "結", "(有)", "祐", "ユ", "湯"],
                                   "よ": ["Yo", "夜", "よ", "4"],
                                   "ら": ["Lact", "ら", "ラ", "らー"],
                                   "り": ["り", "Willie", "リー", "リ", "りー", "りーりー"],
                                   "る": ["流", "る", "ルー"],
                                   "れ": ["0", "れ", "上", "レ"],
                                   "ろ": ["Rola", "ろう", "ろ"],
                                   "わ": ["わ", "わー", "わーわー", "話", "=", "わわ", "わわわ"],
                                   "を": ["Wow", "お"]]
}
